tests/TestCompose_of-of.Ubuntu1604.home/referenceOutput/Fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          41;
        startFace       23692;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          41;
        startFace       23733;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          293;
        startFace       23774;
    }
    slip-bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          81;
        startFace       24067;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          51;
        startFace       24148;
    }
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          161;
        startFace       24199;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          24026;
        startFace       24360;
    }
)

// ************************************************************************* //
